000_РОЗНИЦА_ЦЕНТР/src/Documents/ЛистЖеланий/ЛистЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистЖеланий</name>
  <registerRecords>AccumulationRegister.ЛистыЖеланий</registerRecords>
  <registerRecords>InformationRegister.СостояниеЛистаЖеланий</registerRecords>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Анкета</name>
    <type>
      <types>CatalogRef.АнкетаЛистаЖеланий</types>
    </type>
  </attributes>
  <attributes>
    <name>Корзина</name>
    <type>
      <types>CatalogRef.КорзиныЛистаЖеланий</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/ЛистыЖеланий/ЛистыЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЛистыЖеланий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацияЛистаЖеланий</types>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛистЖеланий</name>
    <type>
      <types>DocumentRef.ЛистЖеланий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корзина</name>
    <type>
      <types>CatalogRef.КорзиныЛистаЖеланий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СостояниеЛистаЖеланий/СостояниеЛистаЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеЛистаЖеланий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОписаниеОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛистЖеланий</name>
    <type>
      <types>DocumentRef.ЛистЖеланий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеЛистаЖеланий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ОперацияЛистаЖеланий/ОперацияЛистаЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацияЛистаЖеланий</name>
  <enumValues>
    <name>Добавление</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПоИстеченииСрока</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СостояниеЛистаЖеланий/СостояниеЛистаЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеЛистаЖеланий</name>
  <enumValues>
    <name>Создание</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ЛистЖеланий/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЛистыЖеланий Приход
	Движения.ЛистыЖеланий.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЛистыЖеланий.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Магазин = Магазин;
		Движение.ЛистЖеланий = Ссылка;
		Движение.Корзина = Корзина;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Операция = Перечисления.ОперацияЛистаЖеланий.Добавление;
	КонецЦикла;
	
	// регистр СостояниеЛистаЖеланий
	Движения.СостояниеЛистаЖеланий.Записывать = Истина;
	Движение = Движения.СостояниеЛистаЖеланий.Добавить();
	Движение.Период = Дата;
	Движение.Магазин = Магазин;
	Движение.ЛистЖеланий = Ссылка;
	Движение.Состояние = Перечисления.СостояниеЛистаЖеланий.Создание;
	
	ОписаниеОперации = "Создан лист желаний №"+ Номер + " от " + Дата + ", на корзину №" + Корзина + "." + Символы.ПС +
	"Добавлена номенклатура: " + Символы.ПС;
	Для каждого Строка Из Товары Цикл
		ОписаниеОперации = ОписаниеОперации + Строка.Номенклатура +" в количестве "+ Строка.Количество + Символы.ПС;
	КонецЦикла; 
	Движение.ОписаниеОперации = ОписаниеОперации;
КонецПроцедуры
